app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "Steves Greatest Works"], ["description", "A short description"], ["created_at", "2020-05-28 13:56:29.552993"], ["updated_at", "2020-05-28 13:56:29.552993"], ["author_id", 4]]

  def edit
    if params[:author_id]
      author = Author.find_by(id: params[:author_id])
      if author.nil?
        redirect_to authors_path, alert: "Author not found."
      else
        @post = author.posts.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]